trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/СтатусыОрдеров/СтатусыОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0129c0d6-654c-4dc1-898d-2a3e14e3a593">
  <name>СтатусыОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="d4beff2a-144a-4498-988f-5bbbeab8659e">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="de5997e7-f493-4c73-a379-054dca0c690b">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="095cde9d-f3f4-468b-95c4-0fb136cb9efa">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="6aad4699-ac61-45c7-99b9-f322f0f20ff7">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВидыОперацийКорректировкиНазначения/ВидыОперацийКорректировкиНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="55921462-a9cd-42ad-9386-49cd47c6df6e">
  <name>ВидыОперацийКорректировкиНазначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fc4361ed-325b-4460-a530-104db1e98919">
    <name>СнятьРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f7cbe6fb-d01a-48b8-93e0-cb3be11dcd09">
    <name>СнятьРезервПоМногимНазначениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e009e0a2-e2b2-4e55-a296-ab8ffe765b9a">
    <name>Резервировать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c23a1733-84b5-4df7-bbbd-2e5b0a20dd00">
    <name>РезервироватьИКорректировать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1ceddb16-0e78-40dc-9848-fd4a0a1ad344">
    <name>ПроизвольнаяКорректировкаНазначений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bd497e3c-da4b-4ffc-bcec-93b90a861a8d">
    <name>ВстречнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("РабочийУчасток",      РабочийУчасток);
		ДанныеЗаполнения.Свойство("Исполнитель",      Исполнитель);
		ДанныеЗаполнения.Свойство("Сотрудник",      Сотрудник);
		ДанныеЗаполнения.Свойство("НомерВходящегоДокумента",      НомерВходящегоДокумента);
		ДанныеЗаполнения.Свойство("Распоряжение",      Распоряжение);
		
		Если Не ЗначениеЗаполнено(НомерВходящегоДокумента) И Не (ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику")
			ИЛИ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")) Тогда
			НомерВходящегоДокумента = Распоряжение.Номер;
		КонецЕсли;
		
		//Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		//	 ОтменаДвиженийРегистраСО = Истина;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийУчасток) И Товары.Количество()>0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
			|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
			|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
			|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
			|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
			|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
			|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
			|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
			|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
			|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
			|ИЗ
			|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
			|	0 КАК Количество,
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
			|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
			|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
			|	0 КАК КоличествоУпаковок,
			|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
			|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
			|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
			|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
			|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
			|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
			|ИЗ
			|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
			|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
			|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
			|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
			|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование";
			
			Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Товары.Выгрузить());
			Запрос.УстановитьПараметр("Склад",Склад);
			Запрос.УстановитьПараметр("РабочиеУчастки",РабочийУчасток);
			
			Товары.Очистить();
			Товары.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		ПроверяемыеРеквизиты.Добавить("НомерВходящегоДокумента");
	КонецЕсли; 
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	ДокументРеализации = ПолучитьДокументРеализации();
	
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) И Не Проведен И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если Не ПометкаУдаления Тогда                               // Записанный документ проводится
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					ДополнительныеСвойства.Вставить("НаличиеКорректировки", НаличиеКорректировки);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда      // Пометка на удаление записанного документа
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Попытка
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Исключение
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда // Пометка на удаление снимается
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Истина);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Попытка
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
					Исключение
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДополнительныеСвойства.Вставить("ЗначениеСтатуса", Ссылка.Статус);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура СоздатьИзменитьБлокировкуДвиженияТоваров()
	
	РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров =
	ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ
	ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров");
	
	Если РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ 
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		
		//Маркировка   
		ТаблицаРасхожденийКМ = МаркировкаАльтерра.ПолучитьРасхожденияПоКодамМаркировки(Товары, ШтрихкодыУпаковок);  
		Если  ТаблицаРасхожденийКМ = Неопределено Или ТаблицаРасхожденийКМ.Пустой() Тогда  
			ЕстьРасхожденияКМ = Ложь;
		Иначе
			ЕстьРасхожденияКМ = Истина; 
		КонецЕсли; 
		//  
		
		БлокировкиПоПриходномуОрдеру = Альтерра_СкладСервер.ПолучитьБлокировкиПоОснования(Ссылка).Выгрузить();   
		//Маркировка 
		БлокировкаКМ = БлокировкиПоПриходномуОрдеру.Найти(Истина, "ПричинаРасхождениеКМ");
		УжеЕстьБлокировкаКМ = НЕ БлокировкаКМ = Неопределено;  
		ДокументБлокировкиКМ = Неопределено;
		//  
		Если БлокировкиПоПриходномуОрдеру.Количество() = 0 Тогда
			ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			//Маркировка
			Если ЕстьРасхожденияКМ Тогда
				ДокументБлокировкиКМ = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			КонецЕсли; 
			//
		ИначеЕсли БлокировкиПоПриходномуОрдеру.Количество() = 1 Тогда  
			//Маркировка
			Если УжеЕстьБлокировкаКМ Тогда  				
				ДокументБлокировкиКМ = БлокировкаКМ.Ссылка.ПолучитьОбъект();
				ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
			Иначе
				Если ЕстьРасхожденияКМ Тогда
					ДокументБлокировкиКМ = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент(); 
				КонецЕсли;
				ДокументБлокировки = БлокировкиПоПриходномуОрдеру[0].Ссылка.ПолучитьОбъект();  
			КонецЕсли;  
			// 
		ИначеЕсли БлокировкиПоПриходномуОрдеру.Количество() = 2 Тогда 
			//Маркировка
			Если УжеЕстьБлокировкаКМ Тогда  			 				
				ДокументБлокировкиКМ = БлокировкаКМ.Ссылка.ПолучитьОбъект(); 
				ДокументБлокировки = БлокировкиПоПриходномуОрдеру.Найти(Ложь, "ПричинаРасхождениеКМ").Ссылка.ПолучитьОбъект();  
			Иначе				
				АльтерраОбщегоНазначения.СообщитьПользователю(, "Внимание, заблокированные товары не соотвествуют приходному ордеру! Документ блокировки не изменен, так как блокировок по данному основанию больше одной!",);
				Возврат;			
			КонецЕсли;  
			// 
		Иначе
			АльтерраОбщегоНазначения.СообщитьПользователю(, "Внимание, заблокированные товары не соотвествуют приходному ордеру! Документ блокировки не изменен, так как блокировок по данному основанию больше одной!",);
			Возврат;
		КонецЕсли;  
		
		ИзлишкиПоПриходу = Альтерра_СкладСервер.ЕстьЛиНеЗаблокированныеТовары(Распоряжение, Ссылка); 
		ИзлишкиИзменены = Ложь;
		
		Если ЕстьРасхожденияКМ И НЕ ИзлишкиПоПриходу.Пустой() Тогда   
			ИзлишкиПоПриходу = ИзменитьКоличествоСУчетомРасхожденийКМ(ИзлишкиПоПриходу.Выгрузить(),ТаблицаРасхожденийКМ.Выгрузить()); 
			ИзлишкиИзменены = Истина;
		КонецЕсли;
		
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата",			  Дата);
		ПараметрыЗаполнения.Вставить("Склад",			  Склад);
		ПараметрыЗаполнения.Вставить("ДокументОснование", Ссылка);
		ПараметрыЗаполнения.Вставить("Статус",			  Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
		ПараметрыЗаполнения.Вставить("Комментарий", 	  "Создан автоматически при принятии приходного ордера");
		ПараметрыЗаполнения.Вставить("ДополнительныеСвойства",	Новый Структура("КонтролироватьОбеспечение", Ложь));
		
		//Блокировка на товары, по которым не хватает кодов маркировки
		Если  ЕстьРасхожденияКМ Тогда 
			
			ПараметрыЗаполнения.Вставить("Товары",ТаблицаРасхожденийКМ);
			ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (нет кода маркировки)"));
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировкиКМ, ПараметрыЗаполнения); 
			Если Не УжеЕстьБлокировкаКМ Тогда  
				Если Не РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров Тогда
					БлокировкаКМ = Документы.ПриходныйОрдерНаТовары.ПолучитьБлокировкуРасхождениеКМ(Ссылка); 
					Если  БлокировкаКМ <> Неопределено Тогда
	   		        	Документы.ПриходныйОрдерНаТовары.ЗапуститьБпПоОтсутствиюКодаМаркировки(Ссылка,Распоряжение,РабочийУчасток,БлокировкаКМ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		Иначе 
			Если ДокументБлокировкиКМ <> Неопределено Тогда
				Если ДокументБлокировкиКМ.Товары.Количество() > 0 И ДокументБлокировкиКМ.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
					ДокументБлокировкиКМ.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Отменено;
					ДокументБлокировкиКМ.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировки.Ссылка, "Отменен документ: " + ДокументБлокировки.Ссылка); 
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
		//Блокировка на излишки
		Если Не ИзлишкиПоПриходу.Пустой() Тогда
			
			ПараметрыЗаполнения.Вставить("Товары",ИзлишкиПоПриходу);				
			Если РаспоряжениеЭтоЗаказНаПеремещениеИлиПеремещениеТоваров Тогда
				ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при перемещении (брак, излишки)")); 
			Иначе
				ПараметрыЗаполнения.Вставить("ПричинаБлокировки", Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию("Расхождения при поступлении (брак, излишки)")); 
			КонецЕсли;
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки, ПараметрыЗаполнения);
			ОтправитьСообщениеМенеджеру(Распоряжение.Товары, Товары);
			
		Иначе 
			Если Альтерра_СкладСервер.НетТоваровСверхРаспоряжения(Распоряжение, Ссылка) Или ИзлишкиИзменены Тогда
				Если ДокументБлокировки.Товары.Количество() > 0 И ДокументБлокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда
					ДокументБлокировки.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Отменено;
					ДокументБлокировки.Записать(РежимЗаписиДокумента.Проведение);
					АльтерраОбщегоНазначения.СообщитьПользователю(ДокументБлокировки.Ссылка, "Отменен документ: " + ДокументБлокировки.Ссылка);
				КонецЕсли;    
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)   
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	#Вставка                                
	УстановитьПривилегированныйРежим(Истина); 
	
	Если Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
		
		Заказ = ПолучитьЗаказ();
		НужнаКорректировкаНазначения = Ложь;
		НужноПровестиБлокировку = Ложь;
		
		Если Не Заказ.Пустая() Тогда		
			Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);	
			Если Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКСнятиюРезерва(Назначение) Тогда
				Если Не ДополнительныеСвойства.Свойство("НаличиеКорректировки") Тогда	
					НужнаКорректировкаНазначения = Истина;  
					Блокировка = ПолучитьБлокировкуДвиженияТоваров();
					
					Если Не Блокировка.Пустая() Тогда
						Попытка
							НужноПровестиБлокировку = Истина;
							БлокировкаОбъект = Блокировка.ПолучитьОбъект();
							БлокировкаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Исключение
							
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;   
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда 
		
		СоздатьИзменитьБлокировкуДвиженияТоваров();  
		
		Если НужноПровестиБлокировку Тогда 
				БлокировкаОбъект.ДополнительныеСвойства.Вставить("ПроведениеИзПриходногоОрдера",Истина);
				БлокировкаОбъект.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;
		
		Если НужнаКорректировкаНазначения Тогда
			СоздатьКорректировку(Заказ,Назначение);
		КонецЕсли;  
		
	КонецЕсли;
		
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если Не ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ.ПеремещениеТоваров",Распоряжение) Тогда
			Если Альтерра_СкладСервер.ТоварПоРаспоряжениюПринят(Распоряжение) Тогда
				МассивПеремещений = Новый Массив();
				МассивПеремещений.Добавить(Распоряжение);
				ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивПеремещений, "Принято",);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗначениеСтатуса") И ДополнительныеСвойства.ЗначениеСтатуса <> Ссылка.Статус Тогда
		//записываем статус в регистр сведений СтатусыОрдеров
		НаборЗаписей = РегистрыСведений.СтатусыОрдеров.СоздатьНаборЗаписей();
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДата();
		Запись.Документ = Ссылка;
		Запись.Статус = Ссылка.Статус;
		Запись.Пользователь = Пользователи.ТекущийПользователь();  
		Запись.Сотрудник  = Альтерра_СкладСервер.ТекущийСотрудник();
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	ПерепровестиПриобретенияТоваров();    
	
	РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьЯчейки(Отказ, Товары.ВыгрузитьКолонку("Номенклатура"), Склад, РабочийУчасток);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	#КонецВставки
	
КонецПроцедуры


Функция ПолучитьЗаказ() 
	
	Заказ = Документы.ЗаказКлиента.ПустаяСсылка();

	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ
		ТипЗнч(Распоряжение) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			Если ТипЗнч(Распоряжение.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				И ЗначениеЗаполнено(Распоряжение.ДокументРеализации.ЗаказКлиента) Тогда
				Заказ = Распоряжение.ДокументРеализации.ЗаказКлиента;
			КонецЕсли;
		Иначеесли ЗначениеЗаполнено(Распоряжение.ДокументОснование.ЗаказКлиента) тогда 
			Заказ = Распоряжение.ДокументОснование.ЗаказКлиента;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Заказ;	
	
КонецФункции

Процедура ОтправитьСообщениеМенеджеру(ТоварыРаспоряжения, ТоварыОрдера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыРаспоряжения.Номенклатура КАК Номенклатура,
	|	ТоварыРаспоряжения.Характеристика КАК Характеристика,
	|	ТоварыРаспоряжения.Назначение КАК Назначение,
	|	ТоварыРаспоряжения.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыРаспоряжения
	|ИЗ
	|	&ТоварыРаспоряжения КАК ТоварыРаспоряжения
	|ГДЕ
	|	НЕ ТоварыРаспоряжения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрдера.Номенклатура КАК Номенклатура,
	|	ТоварыОрдера.Характеристика КАК Характеристика,
	|	ТоварыОрдера.Назначение КАК Назначение,
	|	ТоварыОрдера.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыОрдера
	|ИЗ
	|	&ТоварыОрдера КАК ТоварыОрдера
	|ГДЕ
	|	НЕ ТоварыОрдера.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРаспоряжения.Номенклатура КАК Номенклатура,
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	ТоварыРаспоряжения КАК ТоварыРаспоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ТоварыРаспоряжения.Назначение.Заказ = ЗаказКлиента.Ссылка
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыОрдера КАК ТоварыОрдера
	|		ПО ТоварыРаспоряжения.Номенклатура = ТоварыОрдера.Номенклатура
	|			И ТоварыРаспоряжения.Характеристика = ТоварыОрдера.Характеристика
	|			И ТоварыРаспоряжения.Назначение = ТоварыОрдера.Назначение
	|ГДЕ
	|	ТоварыРаспоряжения.Количество > ТоварыОрдера.Количество
	|ИТОГИ ПО
	|	Менеджер,
	|	Заказ";
	
	Запрос.УстановитьПараметр("ТоварыРаспоряжения", ТоварыРаспоряжения);
	Запрос.УстановитьПараметр("ТоварыОрдера", ТоварыОрдера);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМенеджер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМенеджер.Следующий() Цикл
		Менеджер = ВыборкаМенеджер.Менеджер; 
		
		ВыборкаЗаказ = ВыборкаМенеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтрокаСообщения = "";
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			Заказ = ВыборкаЗаказ.Заказ;
			
			МассивНоменклатуры = Новый Массив;
			
			Выборка = ВыборкаЗаказ.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				МассивНоменклатуры.Добавить(Выборка.Номенклатура);
				
			КонецЦикла;
			
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + Строка(Заказ) + Символы.ПС + СтрСоединить(МассивНоменклатуры, Символы.ПС);
			
		КонецЦикла;
		
		ТекстСообщения = "По следующим позициям создана блокировка товаров:" + Символы.ПС + СтрокаСообщения;
		
		АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТекстСообщения, Менеджер);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьКорректировкиНазначенияПоЗаказу(Заказ)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
	|ГДЕ
	|	КорректировкаНазначенияТоваров.Проведен = Истина
	|	И КорректировкаНазначенияТоваров.Назначение.Заказ = &Заказ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	
	Выборка = Запрос.Выполнить();
	
	Если Выборка.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Альтерра_СкладСервер.ПоДокументуЕстьАктПоРасхождениям(ЭтотОбъект.Распоряжение) И не АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		Сообщить("По документу основанию есть акт по расхождениям, реадактирование заблокировано!");
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ПометкаУдаления = ЛОЖЬ
		|	И БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			БлокировкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			БлокировкаОбъект.УстановитьПометкуУдаления(Истина);
			Сообщить("Удален: "+БлокировкаОбъект.Ссылка);
		КонецЦикла;
		
		////Поиск и установка пометки удаления файлов, присоединенных через ТСД
		ИмяПапки = СтрЗаменить(СтрЗаменить(Строка(ЭтотОбъект.Ссылка), ":", "_"), " ", "_");
		ПапкаСФайламиОрдера = Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина);
		Если ЗначениеЗаполнено(ПапкаСФайламиОрдера) Тогда
			ПапкаОрдера = ПапкаСФайламиОрдера.ПолучитьОбъект();
			ПапкаОрдера.ПометкаУдаления = Истина;
			ПапкаОрдера.Записать();
		КонецЕсли;
		////
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	ДокументРеализации = ПолучитьДокументРеализации();		
	Если Не Отказ И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Истина, Ложь);
		Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
			Попытка
				Если ПометкаУдаления Тогда // Пометка на удаление проведенного документа
					НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
				Иначе                      // Распроведение документа
					НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения1(Отказ)
	
	ОбъектРаспоряжение = Распоряжение.ПолучитьОбъект();
	НуженКонтрольОтметкиКассы = ОбъектРаспоряжение.Метаданные().Реквизиты.Найти("Кассир") <> Неопределено;
	
	Если НуженКонтрольОтметкиКассы И Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
		АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ОбменУТМПСервер.УдалитьСвязанныеЗаписиОбменМП(Ссылка);
	
КонецПроцедуры

Функция ПолучитьДокументРеализации()
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Возврат Распоряжение.ДокументРеализации;
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Возврат Распоряжение.ДокументОснование;
	Иначе
		Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
КонецФункции


Процедура ПерепровестиПриобретенияТоваров()
	
	// Проверка на другие принятые приходные ордера у заказа поставщику в этом приходном ордере
	Запрос = Новый Запрос;	
	Запрос.Текст =  
	"ВЫБРАТЬ 
	|	ДругойПриходныйОрдер.Ссылка  ДругойПриходныйОрдерСсылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдер
	|	СОЕДИНЕНИЕ 
	|		Документ.ЗаказПоставщику КАК Заказ
	|		ПО 
	|			ВЫРАЗИТЬ(ПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка = Заказ.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПриходныйОрдерНаТовары КАК ДругойПриходныйОрдер
	|		ПО 
	|			Заказ.Ссылка = ВЫРАЗИТЬ(ДругойПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка
	|			И ДругойПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|			И ПриходныйОрдер.ССылка <> ДругойПриходныйОрдер.Ссылка
	|ГДЕ ПриходныйОрдер.Ссылка = &ПриходныйОрдер	
	|И ПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)";
	
	Запрос.УстановитьПараметр("ПриходныйОрдер", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		
		Если Выборка.ДругойПриходныйОрдерСсылка = Null Тогда
			
			// Получение списка приобретений для перепроведения		
			ЗапросНаИзменения = Новый Запрос;	
			ЗапросНаИзменения.Текст =  
			"ВЫБРАТЬ 
			|	Приобретение.Ссылка ПриобретениеСсылка
			|ИЗ
			|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдер
			|СОЕДИНЕНИЕ 
			|	Документ.ЗаказПоставщику КАК Заказ
			|	ПО 
			|		ВЫРАЗИТЬ(ПриходныйОрдер.Распоряжение КАК Документ.ЗаказПоставщику).Ссылка = Заказ.Ссылка
			|СОЕДИНЕНИЕ 
			|	Документ.ПриобретениеТоваровУслуг КАК Приобретение
			|	ПО 
			|		Заказ.Ссылка = Приобретение.ЗаказПоставщику
			|     	И Приобретение.ПометкаУдаления = Ложь
			|ГДЕ ПриходныйОрдер.Ссылка = &ПриходныйОрдер	
			|И ПриходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)";
			
			ЗапросНаИзменения.УстановитьПараметр("ПриходныйОрдер", Ссылка);
			ВыборкаНаИзменения = ЗапросНаИзменения.Выполнить().Выбрать();
			
			ОшибкаПриПроведении = Ложь;
			
			Пока ВыборкаНаИзменения.Следующий() Цикл
				
				Если Не ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ.ПриобретениеТоваровУслуг",ВыборкаНаИзменения.ПриобретениеСсылка) Тогда
					ДокументОбъект = ВыборкаНаИзменения.ПриобретениеСсылка.ПолучитьОбъект();	
					ДокументОбъект.Дата = Дата - 300;
					Для каждого Строка Из ДокументОбъект.ЭтапыГрафикаОплаты Цикл
						Строка.ДатаПлатежа = Дата+24*60*60; 
					КонецЦикла;
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ОшибкаПриПроведении = Истина;
					КонецПопытки
				Иначе
					ОшибкаПриПроведении = Истина;
				КонецЕсли;
				
				Если ОшибкаПриПроведении Тогда
					Сообщить("Не удалось перепровести приобретение!");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьКорректировку(Заказ,Назначение)
	
	КорректировкаНазначения = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
	
	КорректировкаНазначения.Организация = Организация;
	КорректировкаНазначения.Назначение = Назначение;
	КорректировкаНазначения.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
	//КорректировкаНазначения.ДокументПоРаспоряжению = ЗначениеЗаполнено(Заказ);
	КорректировкаНазначения.Дата = ТекущаяДатаСеанса();
	КорректировкаНазначения.УстановитьНовыйНомер();
	КорректировкаНазначения.Автор = Справочники.Пользователи.НайтиПоНаименованию("Администратор"); 
	КорректировкаНазначения.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КорректировкаНазначения.Комментарий = "Создана автоматически при создании документа "" " + Ссылка + """";
	
	Для Каждого СтрокаТовара Из Товары Цикл
		Если СтрокаТовара.Назначение = Назначение Тогда
			СтрокаПродукция = КорректировкаНазначения.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(КорректировкаНазначения, Документы.КорректировкаНазначенияТоваров));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(КорректировкаНазначения, ПараметрыУказанияСерий);
	
	Документы.КорректировкаНазначенияТоваров.ЗаполнитьПоОснованию(Назначение, 
	Организация,
	КорректировкаНазначения.Ссылка, 
	Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв, 
	КорректировкаНазначения.Товары,
	КорректировкаНазначения.Товары.Выгрузить());
	
	СкладЗаполнен = Истина;
	
	Для каждого Строка из КорректировкаНазначения.Товары Цикл
		Если Не ЗначениеЗаполнено(Строка.Склад) Тогда
			СкладЗаполнен = Ложь;
			Сообщить("Корректировка назначения не создана. Передайте информацию технической поддержке."); 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КорректировкаНазначения.Товары.Количество()>0 И СкладЗаполнен Тогда
		КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Если ЕстьКорректировкиНазначенияПоЗаказу(Заказ) Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю(, "По заказу есть корректировки назначения!",);
	КонецЕсли;
	
КонецПроцедуры
	
Функция ПолучитьБлокировкуДвиженияТоваров() 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
		|ГДЕ
		|	БлокировкаДвиженияТоваров.ДокументОснование = &ДокументОснование
		|	И БлокировкаДвиженияТоваров.ПометкаУдаления = ЛОЖЬ
		|	И БлокировкаДвиженияТоваров.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ДокументОснование", Распоряжение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда  
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Документы.БлокировкаДвиженияТоваров.ПустаяСсылка();
		КонецЕсли;
		
	КонецФункции
	
Функция ИзменитьКоличествоСУчетомРасхожденийКМ(ИзлишкиПоПриходу,РасхжденияКМ)
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзлишкиПоПриходу.Номенклатура КАК Номенклатура,
		|	ИзлишкиПоПриходу.Характеристика КАК Характеристика,
		|	ИзлишкиПоПриходу.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ИзлишкиПоПриходу
		|ИЗ
		|	&ИзлишкиПоПриходу КАК ИзлишкиПоПриходу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасхжденияКМ.Номенклатура КАК Номенклатура,
		|	РасхжденияКМ.Характеристика КАК Характеристика,
		|	РасхжденияКМ.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ РасхжденияКМ
		|ИЗ
		|	&РасхжденияКМ КАК РасхжденияКМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзлишкиПоПриходу.Номенклатура КАК Номенклатура,
		|	ИзлишкиПоПриходу.Характеристика КАК Характеристика,
		|	ИзлишкиПоПриходу.КоличествоУпаковок - ЕстьNull(РасхжденияКМ.КоличествоУпаковок,0) КАК КоличествоУпаковок
		|ИЗ
		|	ИзлишкиПоПриходу КАК ИзлишкиПоПриходу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасхжденияКМ КАК РасхжденияКМ
		|		ПО ИзлишкиПоПриходу.Номенклатура = РасхжденияКМ.Номенклатура
		|			И ИзлишкиПоПриходу.Характеристика = РасхжденияКМ.Характеристика
		|   ГДЕ (ИзлишкиПоПриходу.КоличествоУпаковок - ЕстьNull(РасхжденияКМ.КоличествоУпаковок,0)) > 0"; 
		
		Запрос.УстановитьПараметр("ИзлишкиПоПриходу",ИзлишкиПоПриходу);
		Запрос.УстановитьПараметр("РасхжденияКМ",РасхжденияКМ);
	Возврат Запрос.Выполнить();	
		
	КонецФункции
	
#КонецЕсли
